:PROPERTIES:
:ID:       8b718e4f-8b5f-492d-a483-8d37b2858f1e
:END:
#+TITLE: Dynamic Programming
#+roam_tags: Technology

[[https://en.wikipedia.org/wiki/Dynamic_programming][Wikipedia]]

** can sum
#+begin_src rust
use std::collections::HashMap;

fn main() {
    println!("{}", solve(7, &vec![3, 3, 1, 2], &mut HashMap::new()));
}

fn solve(target: i128, numbers: &Vec<i128>, memo: &mut HashMap<i128, bool>) -> bool {
    println!("{}{:?}", target, numbers);
    if memo.contains_key(&target) {
        return *memo.get(&target).unwrap();
    }
    if target < 0 {
        return false;
    }
    if target == 0 {
        return true;
    };
    for n in numbers.into_iter() {
        let remind = target - n;
        if solve(remind, &numbers, memo) == true {
            memo.insert(target, true);
            return true;
        };
    }
    memo.insert(target, false);
    return false;
}

#[cfg(test)]
mod tests {
    use super::*;
    #[test]
    fn should_pass() {
        assert_eq!(true, solve(7, &vec![3, 3, 1], &mut HashMap::new()));
    }
    #[test]
    fn t1() {
        assert_eq!(
            true,
            solve(70, &vec![3, 3, 3, 1, 50, 5, 5, 5, 5], &mut HashMap::new())
        );
    }
    #[test]
    fn t2() {
        assert_eq!(true, solve(1, &vec![1], &mut HashMap::new()));
    }
    #[test]
    fn t3() {
        assert_ne!(true, solve(1, &vec![5], &mut HashMap::new()));
    }
    #[test]
    fn t4() {
        assert_eq!(true, solve(0, &vec![5], &mut HashMap::new()));
    }
    #[test]
    fn t5() {
        assert_eq!(true, solve(3, &vec![1, 5, 4], &mut HashMap::new()));
    }
    #[test]
    fn t6() {
        assert_eq!(true, solve(100, &vec![5], &mut HashMap::new()));
    }
    #[test]
    fn t7() {
        assert_eq!(true, solve(0, &vec![], &mut HashMap::new()));
    }
    #[test]
    fn t8() {
        assert_eq!(true, solve(40000, &vec![1], &mut HashMap::new()));
    }
    #[test]
    fn t9() {
        assert_eq!(
            false,
            solve(
                1,
                &vec![2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2],
                &mut HashMap::new()
            )
        );
    }
}
#+end_src

#+RESULTS:
: 7[3, 3, 1, 2]
: 4[3, 3, 1, 2]
: 1[3, 3, 1, 2]
: -2[3, 3, 1, 2]
: -2[3, 3, 1, 2]
: 0[3, 3, 1, 2]
: true

